IDENTIFICATION DIVISION
PROGRAM-ID. ABC123MO.
AUTHOR. PRODX TEAM.
DATE-WRITTEN. 28/11/2025.
DATE COMPILED.

ENVIRONMENT DIVISION.
DATA DIVISION.

WORKING-STORAGE SECTION.

01 WF-FLAGS.
  03 WF-FAULT-ISSUE      PIC X(01).
    88 YES-FLAG               VALUE 'Y'.
    88 NO-FLAG                VALUE 'N'.
  03 WF-RECORD           PIC X(01).
    88 RECORD-INS-YES         VALUE 'Y'.
    88 RECORD-INS-NO          VALUE 'N'.

01  WS-CHANNEL-NAME. 
  10  WS-CHANNEL        PIC X(16).

01  WS-REQUEST-CONTAINER.
  10  WS-CUSTOMER-ID    PIC 9(10).
  10  WS-CREDIT-CARD    PIC 9(14).
  10  WS-CUSTOMER-NAME  PIC X(30).
  10  WS-CUSTOMER-DOB   PIC X(10).
  10  WS-SECURITY-QU    PIC X(20).
  10  WS-CARD-STATUS    PIC X(01).
  10  WS-CARD-OPEN-DT   PIC X(10).
  10  WS-CARD-CLOSE-DT  PIC X(10).

01  WS-RESPONSE-CONTAINER.
  10  WS-RESPONSE-CODE  PIC 9(02).

01  WS-FAULT-CONTAINER. 
  10  WS-ERROR-CODE     PIC X(06).
  10  WS-ERROR-TXT      PIC X(70).

EXEC SQL
    INCLUDE SQLCA
END-EXEC.

EXEC SQL
    INCLUDE TCCDTLS
END-EXEC.

PROCEDURE DIVISION.

A000-INITIALISATION SECTION.
  INITIALIZE  TCCDTLS
              WF-FLAGS
              WS-REQUEST-CONTAINER
              WS-RESPONSE-CONTAINER
              WS-FAULT-CONTAINER

  SET NO-FLAG    TO TRUE
  .

B000-ASSIGN-CHANNEL SECTION.
  EXEC CICS 
        ASSIGN CHANNEL (WS-CHANNEL)
  END-EXEC

  IF WS-CHANNEL = SPACES
      MOVE 'NO CHANNEL SUPPLIED' TO WS-ERROR-TEXT
                                 OF XXYYZZ
      CALL XXYYZZ USING WS-ERROR-TEXT

      EXEC CICS
          ABEND 
          ABCODE ('NOCH')
          CANCEL
      END-EXEC.
  END-IF

  PERFORM I000-TERMINATION
  .

C000-GET-REQUEST-CONT SECTION.

  EXEC CICS 
        GET
        CONTAINER (REQUEST-CONT)
        CHANNEL (WS-CHANNEL)
        INTO (WS-REQUEST-CONTAINER)
        FLENGTH (LENGTH OF WS-REQUEST-CONTAINER)
        RESP (WS-CICS-RESP)
        RESP2 (WS-CICS-RESP2)
  END-EXEC

  IF WS-CICS-RESP = 0
    CONTINUE
  ELSE
    SET YES-FLAG TO TRUE
    IF WS-CICS-RESP = 10
      MOVE 'ERR01' TO WS-ERROR-CODE
                   OF XXYYZZ
      MOVE 'Request container not found' TO WS-ERROR-TEXT
                    OF XXYYZZ
    ELSE
      MOVE 'ERR02' TO WS-ERROR-CODE
                   OF XXYYZZ
      MOVE 'Error in getting Request container' TO WS-ERROR-TEXT
                    OF XXYYZZ
    END-IF
    CALL XXYYZZ USING WS-ERROR-CODE WS-ERROR-TEXT
    PERFORM G000-PUT-FAULT-CONT
    PERFORM I000-TERMINATION
  END-IF
  .

D000-POPULATE-DCLGEN SECTION.

  MOVE WS-CREDIT-CARD TO CREDIT-CARD-NO OF TCCDTLS
  MOVE WS-CUSTOMER-ID TO CUSTOMER-ID OF TCCDTLS
  MOVE WS-CUSTOMER-NAME TO CUSTOMER-NAME OF TCCDTLS
  MOVEWS-CUSTOMER-DOB TO CUSTOMER-DOB OF TCCDTLS
  MOVE WS-SECURITY-QU TO SECURITY-QUESTION OF TCCDTLS
  MOVE WS-CARD-STATUS TO CARD-STATUS OF TCCDTLS
  MOVE WS-CARD-OPEN-DT TO CARD-OPEN-DATE OF TCCDTLS
  MOVE WS-CARD-CLOSE-DT TO CARD-CLOSE-DATE OF TCCDTLS
.

E000-GET-CARD-DETAILS SECTION.

  EXEC SQL
    INSERT INTO CREDIT_CARD (
          CUSTOMER_NAME,
          CUSTOMER_DOB,
          SECURITY_QUESTION,
          CARD_STATUS,
          CARD_OPEN_DATE,
          CARD_CLOSE_DATE)
    VALUES (
          :TCCDTLS.CUSTOMER-NAME,
          :TCCDTLS.CUSTOMER-DOB,
          :TCCDTLS.SECURITY-QUESTION,
          :TCCDTLS.CARD-STATUS,
          :TCCDTLS.CARD-OPEN-DATE,
          :TCCDTLS.CARD-CLOSE-DATE)
  END-EXEC

IF SQLCODE = 0
  SET RECORD-INS-YES TO TRUE
ELSE
  SET YES-FLAG TO TRUE
    MOVE 'ERR03' TO WS-ERROR-CODE
                   OF XXYYZZ
    MOVE 'Error in executing DB2 query' TO WS-ERROR-TEXT
                    OF XXYYZZ
    CALL XXYYZZ USING WS-ERROR-CODE WS-ERROR-TEXT
    PERFORM I000-TERMINATION
    PERFORM G000-PUT-FAULT-CONT
  END-IF
END-IF.

F000-POPULATE-RESP-CONT SECTION.

  IF RECORD-INS-YES 
    MOVE 00 TO WS-RESPONSE-CODE
  ELSE
    MOVE 04 TO WS-RESPONSE-CODE
  END-IF.

G000-PUT-RESPONSE-CONT SECTION.

  EXEC CICS 
        PUT
        CONTAINER (RESPONSE-CONT)
        CHANNEL (WS-CHANNEL)
        FROM  (WS-RESPONSE-CONTAINER)
        FLENGTH (LENGTH OF WS-RESPONSE-CONTAINER)
        RESP (WS-CICS-RESP)
        RESP2 (WS-CICS-RESP2)
  END-EXEC

  IF WS-CICS-RESP = 0
    CONTINUE
  ELSE
    SET YES-FLAG TO TRUE
      MOVE 'ERROR IN PUTTING RESPONSE CONTAINER' TO WS-ERROR-TEXT
                                 OF XXYYZZ
      CALL XXYYZZ USING WS-ERROR-TEXT

      EXEC CICS
          ABEND 
          ABCODE ('PUTF')
          CANCEL
      END-EXEC.
  END-IF
  
  PERFORM I000-TERMINATION
  .

H000-TERMINATION SECTION.

EXEC CICS
    RETURN
END-EXEC
.

Z000-PUT-FAULT-CONT SECTION.

  EXEC CICS 
        PUT
        CONTAINER (FAULT-CONT)
        CHANNEL (WS-CHANNEL)
        FROM  (WS-FAULT-CONTAINER)
        FLENGTH (LENGTH OF WS-FAULT-CONTAINER)
        RESP (WS-CICS-RESP)
        RESP2 (WS-CICS-RESP2)
  END-EXEC

  IF WS-CICS-RESP = 0
    CONTINUE
  ELSE
    SET YES-FLAG TO TRUE
      MOVE 'ERROR IN PUTTING FAULT CONTAINER' TO WS-ERROR-TEXT
                                 OF XXYYZZ
      CALL XXYYZZ USING WS-ERROR-TEXT

      EXEC CICS
          ABEND 
          ABCODE ('PUTF')
          CANCEL
      END-EXEC.
  END-IF

  PERFORM I000-TERMINATION
  .
