IDENTIFICATION DIVISION
PROGRAM-ID. ZZ123456.
AUTHOR. PRODX TEAM.
DATE-WRITTEN. 27/11/2025.
DATE COMPILED.

ENVIRONMENT DIVISION.
DATA DIVISION.

WORKING-STORAGE SECTION.

01 WF-FLAGS.
  03 WF-FAULT-ISSUE      PIC X(01).
    88 YES-FLAG               VALUE 'Y'.
    88 NO-FLAG                VALUE 'N'.
  03 WF-RECORD           PIC X(01).
    88 FOUND-YES-FLAG         VALUE 'Y'.
    88 FOUND-NO-FLAG          VALUE 'N'.

01  WS-CHANNEL-NAME. 
  10  WS-CHANNEL        PIC X(16).

01  WS-REQUEST-CONTAINER1. 
  10  WS-CUSTOMER-ID    PIC 9(10).

01  WS-REQUEST-CONTAINER2. 
  10  WS-CREDIT-CARD    PIC 9(14).

01  WS-RESPONSE-CONTAINER1. 
  10  WS-RESPONSE-CODE  PIC 9(02).
  10  WS-CUSTOMER-ID    PIC 9(10).
  10  WS-CREDIT-CARD    PIC 9(14).
  10  WS-CUSTOMER-NAME  PIC X(30).
  10  WS-CUSTOMER-DOB   PIC X(10).
  10  WS-SECURITY-QU    PIC X(20).
  10  WS-CARD-STATUS    PIC X(01).
  10  WS-CARD-OPEN-DT   PIC X(10).
  10  WS-CARD-CLOSE-DT  PIC X(10).

01  WS-FAULT-CONTAINER1. 
  10  WS-ERROR-CODE     PIC X(06).
  10  WS-ERROR-TXT      PIC X(70).

EXEC SQL
    INCLUDE SQLCA
END-EXEC.

EXEC SQL
    INCLUDE TCCDTLS
END-EXEC.

PROCEDURE DIVISION.

A000-INITIALISATION SECTION.
  INITIALIZE  TCCDTLS
              WF-FLAGS
              WS-REQUEST-CONTAINER1
              WS-REQUEST-CONTAINER2
              WS-RESPONSE-CONTAINER1
              WS-FAULT-CONTAINER1

  SET NO-FLAG    TO TRUE
  .

B000-ASSIGN-CHANNEL SECTION.
  EXEC CICS 
        ASSIGN CHANNEL (WS-CHANNEL)
  END-EXEC

  IF WS-CHANNEL = SPACES
      MOVE 'NO CHANNEL SUPPLIED' TO WS-ERROR-TEXT
                                 OF XXYYZZ
      CALL XXYYZZ USING WS-ERROR-TEXT

      EXEC CICS
          ABEND 
          ABCODE ('NOCH')
          CANCEL
      END-EXEC.
  END-IF

  PERFORM I000-TERMINATION
  .

C000-GET-REQUEST-CONT1 SECTION.

  EXEC CICS 
        GET
        CONTAINER (REQUEST-CONT-1)
        CHANNEL (WS-CHANNEL)
        INTO (WS-REQUEST-CONTAINER1)
        FLENGTH (LENGTH OF WS-REQUEST-CONTAINER1)
        RESP (WS-CICS-RESP)
        RESP2 (WS-CICS-RESP2)
  END-EXEC

  IF WS-CICS-RESP = 0
    CONTINUE
  ELSE
    SET YES-FLAG TO TRUE
    IF WS-CICS-RESP = 10
      MOVE 'ERR01' TO WS-ERROR-CODE
                   OF XXYYZZ
      MOVE 'Request container 1 not found' TO WS-ERROR-TEXT
                    OF XXYYZZ
    ELSE
      MOVE 'ERR02' TO WS-ERROR-CODE
                   OF XXYYZZ
      MOVE 'Error in getting Request container 1' TO WS-ERROR-TEXT
                    OF XXYYZZ
    END-IF
    CALL XXYYZZ USING WS-ERROR-CODE WS-ERROR-TEXT
    PERFORM G000-PUT-FAULT-CONT
    PERFORM I000-TERMINATION
  END-IF
  .

D000-GET-REQUEST-CONT2 SECTION.

  EXEC CICS 
        GET
        CONTAINER (REQUEST-CONT-2)
        CHANNEL (WS-CHANNEL)
        INTO (WS-REQUEST-CONTAINER2)
        FLENGTH (LENGTH OF WS-REQUEST-CONTAINER2)
        RESP (WS-CICS-RESP)
        RESP2 (WS-CICS-RESP2)
  END-EXEC

  IF WS-CICS-RESP = 0
    CONTINUE
  ELSE
    SET YES-FLAG TO TRUE
    IF WS-CICS-RESP = 10
      MOVE 'ERR01' TO WS-ERROR-CODE
                   OF XXYYZZ
      MOVE 'Request container 2 not found' TO WS-ERROR-TEXT
                    OF XXYYZZ
    ELSE
      MOVE 'ERR02' TO WS-ERROR-CODE
                   OF XXYYZZ
      MOVE 'Error in getting Request container 2' TO WS-ERROR-TEXT
                    OF XXYYZZ
    END-IF
    CALL XXYYZZ USING WS-ERROR-CODE WS-ERROR-TEXT
    PERFORM G000-PUT-FAULT-CONT
    PERFORM I000-TERMINATION
  END-IF
  .

E000-GET-CARD-DETAILS SECTION.

  MOVE WS-CREDIT-CARD TO CREDIT-CARD-NO OF TCCDTLS
  MOVE WS-CUSTOMER-ID TO CUSTOMER-ID OF TCCDTLS

  EXEC SQL
    SELECT CUSTOMER_NAME,
          CUSTOMER_DOB,
          SECURITY_QUESTION,
          CARD_STATUS,
          CARD_OPEN_DATE,
          CARD_CLOSE_DATE
    INTO
          :TCCDTLS.CUSTOMER-NAME,
          :TCCDTLS.CUSTOMER-DOB,
          :TCCDTLS.SECURITY-QUESTION,
          :TCCDTLS.CARD-STATUS,
          :TCCDTLS.CARD-OPEN-DATE,
          :TCCDTLS.CARD-CLOSE-DATE
    FROM CREDIT_CARD
    WHERE CUSTOMER_ID = :TCCDTLS.CUSTOMER-ID
    AND CREDIT_CARD_NO = :TCCDTLS.CREDIT-CARD-NO
  END-EXEC

IF SQLCODE = 0
  SET FOUND-YES-FLAG TO TRUE
ELSE
  IF SQLCODE = 100
    SET FOUND-NO-FLAG TO TRUE
  ELSE
    SET YES-FLAG TO TRUE
    MOVE 'ERR03' TO WS-ERROR-CODE
                   OF XXYYZZ
    MOVE 'Error in executing DB2 query' TO WS-ERROR-TEXT
                    OF XXYYZZ
    CALL XXYYZZ USING WS-ERROR-CODE WS-ERROR-TEXT
    PERFORM I000-TERMINATION
    PERFORM G000-PUT-FAULT-CONT
  END-IF
END-IF.

F000-POPULATE-RESP-CONT SECTION.

  IF FOUND-YES-FLAG 
    MOVE 00 TO WS-RESPONSE-CODE
    MOVE CUSTOMER-ID OF TCCDTLS
                     TO WS-CUSTOMER-ID
    MOVE CREDIT-CARD-NO OF TCCDTLS
                     TO WS-CREDIT-CARD
    MOVE CUSTOMER-NAME OF TCCDTLS
                     TO WS-CUSTOMER-NAME
    MOVE CUSTOMER-DOB OF TCCDTLS
                     TO WS-CUSTOMER-DOB
    MOVE SECURITY-QUESTION OF TCCDTLS
                     TO WS-SECURITY-QU
    MOVE CARD-STATUS OF TCCDTLS
                     TO WS-CARD-STATUS
    MOVE CARD-OPEN-DATE OF TCCDTLS
                     TO WS-CARD-OPEN-DT
    MOVE CARD-CLOSE-DATE OF TCCDTLS
                     TO WS-CARD-CLOSE-DT
  ELSE
    MOVE 04 TO WS-RESPONSE-CODE
  END-IF.

G000-PUT-RESPONSE-CONT SECTION.

  EXEC CICS 
        PUT
        CONTAINER (RESPONSE-CONT-1)
        CHANNEL (WS-CHANNEL)
        FROM  (WS-RESPONSE-CONTAINER1)
        FLENGTH (LENGTH OF WS-RESPONSE-CONTAINER1)
        RESP (WS-CICS-RESP)
        RESP2 (WS-CICS-RESP2)
  END-EXEC

  IF WS-CICS-RESP = 0
    CONTINUE
  ELSE
    SET YES-FLAG TO TRUE
      MOVE 'ERROR IN PUTTING RESPONSE CONTAINER' TO WS-ERROR-TEXT
                                 OF XXYYZZ
      CALL XXYYZZ USING WS-ERROR-TEXT

      EXEC CICS
          ABEND 
          ABCODE ('PUTF')
          CANCEL
      END-EXEC.
  END-IF
  
  PERFORM I000-TERMINATION
  .

H000-TERMINATION SECTION.

EXEC CICS
    RETURN
END-EXEC
.

Z000-PUT-FAULT-CONT SECTION.

  EXEC CICS 
        PUT
        CONTAINER (FAULT-CONT-1)
        CHANNEL (WS-CHANNEL)
        FROM  (WS-FAULT-CONTAINER1)
        FLENGTH (LENGTH OF WS-FAULT-CONTAINER1)
        RESP (WS-CICS-RESP)
        RESP2 (WS-CICS-RESP2)
  END-EXEC

  IF WS-CICS-RESP = 0
    CONTINUE
  ELSE
    SET YES-FLAG TO TRUE
      MOVE 'ERROR IN PUTTING FAULT CONTAINER' TO WS-ERROR-TEXT
                                 OF XXYYZZ
      CALL XXYYZZ USING WS-ERROR-TEXT

      EXEC CICS
          ABEND 
          ABCODE ('PUTF')
          CANCEL
      END-EXEC.
  END-IF

  PERFORM I000-TERMINATION
  .
